Revit 2027 API
VertexStreamPosition.AddVertices Method
 Inserts multiple VertexStreamPosition instances into the stream and associated buffer.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddVertices(
	IList<VertexPosition> vertices
)
Public Sub AddVertices (
	vertices As IList(Of VertexPosition)
)
public:
void AddVertices(
	IList<VertexPosition^>^ vertices
)
member AddVertices :
        vertices : IList<VertexPosition> -> unit
Parameters
vertices IList<VertexPosition>
 The vertices to be inserted.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Thrown if the associated buffer is not mapped. -or- Thrown if the associated buffer has insufficient space.
See Also
Reference
VertexStreamPosition Class
Autodesk.Revit.DB.DirectContext3D Namespace